# SQL Assignment 4

In [3]:
import mysql.connector as conn

mydb = conn.connect(host = 'localhost', user = 'root', passwd = 'Cricket', use_pure = True)
cursor = mydb.cursor(buffered=True)
cursor.execute('use Worker')

## Q-1. Write an SQL query to print the FIRST_NAME from Worker table after replacing ‘a’ with ‘A’.

In [7]:
cursor.execute("select replace(first_name,'a', 'A') from Worker")
cursor.fetchall()

[('VishAl',),
 ('RAhul',),
 ('AnishA',),
 ('SAkshAm',),
 ('AAkAsh',),
 ('Ankit',),
 ('RiyA',),
 ('Nishit',),
 ('SAmAy',),
 ('AmAn',),
 ('SArthAk',),
 ('Ashutosh',),
 ('HArshit',),
 ('Ayush',),
 ('ShreyAnsh',),
 ('AryAn',),
 ('SnehAl',),
 ('ShubhAm',),
 ('RAkshit',)]

## Q-2. Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending and DEPARTMENT Descending.

In [12]:
cursor.execute("select * from Worker order by first_name asc, department desc")
cursor.fetchall()

[(5, 'Aakash', 'Singh', 'Purchase'),
 (10, 'Aman', 'Singh', 'Finance'),
 (3, 'Anisha', 'Gour', 'Purchase'),
 (6, 'Ankit', 'Kumar', 'Marketing'),
 (16, 'Aryan', 'Sharma', 'Finance'),
 (12, 'Ashutosh', 'Patil', 'PR'),
 (14, 'Ayush', 'Srivastav', 'Purchase'),
 (13, 'Harshit', 'Kumar', 'HR'),
 (8, 'Nishit', 'Sharma', 'Purchase'),
 (2, 'Rahul', 'Sarathe', 'HR'),
 (19, 'Rakshit', 'Rao', 'Marketing'),
 (7, 'Riya', 'Agarwal', 'Finance'),
 (4, 'Saksham', 'Mahajan', 'Finance'),
 (9, 'Samay', 'Raina', 'Marketing'),
 (11, 'Sarthak', 'Jain', 'Purchase'),
 (15, 'Shreyansh', 'Deriya', 'PR'),
 (18, 'Shubham', 'Mittal', 'PR'),
 (17, 'Snehal', 'Reddy', 'HR'),
 (1, 'Vishal', 'Rathore', 'Finance')]

## Q-3. Write an SQL query to fetch the names of workers who earn the highest salary.

In [15]:
cursor.execute('select first_name, max(salary) from Worker1')
cursor.fetchall()

[('Shashvath', 1200000)]

In [18]:
cursor.execute('select * from Worker1 order by salary desc limit 1')
cursor.fetchall()

[('Shashvath', 'Analyst', 1200000)]